BackEnd/app/controllers/blogs_controller.rb

    def showBlogs
        my_blogs = Blogs.all
---
SELECT "blogs".* FROM "blogs"

    def singleBlog
    #    blog = Blogs.find(params[:id])
         blog = Blogs.where(['blog_title LIKE ?', "%#{params['title']}%"])
---
SELECT "blogs".* FROM "blogs" WHERE (blog_title LIKE '%mumbai%')

    def viewBlog

        blog = Blogs.find(params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

    def createBlog
        new_blog = Blogs.new(
            blog_title: params[:blog_title],
            blog_desc: params[:blog_desc],
            blog_content: params[:blog_content],
            blog_type: params[:blog_type]
        )
        new_blog.save
---
INSERT INTO "blogs" ("blog_title", "blog_desc", "blog_content", "blog_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def deleteBlog
        @blog = Blogs.find(params[:id])
        @blog.destroy
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 7]]

    def editBlog
        blog = Blogs.find(params[:id])
        blog.blog_title = params[:blog_title]
        blog.blog_desc = params[:blog_desc]
        blog.blog_content = params[:blog_content]
        blog.blog_type = params[:blog_type]
        blog.save
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "blogs" SET "blog_content" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["blog_content", "hellooo"], ["updated_at", "2022-07-09 07:57:16.522092"], ["id", 6]]