BackEnd/app/controllers/users_controller.rb

    def usersList
        data = User.all
---
SELECT "users".* FROM "users"

    def addUser
        data=User.new({
            "user_name"=>params[:user_name],
            "user_email"=>params[:user_email],
            "user_password"=>params[:user_password]
        })
        data.save
---
INSERT INTO "users" ("user_name", "user_email", "user_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_name", "rajan"], ["user_email", "rajan@gmail.com"], ["user_password", "[FILTERED]"], ["created_at", "2022-07-09 04:16:20.568840"], ["updated_at", "2022-07-09 04:16:20.568840"]]

    def login
        user = User.find_by(user_email: params['user_email'])
---
SELECT "users".* FROM "users" WHERE "users"."user_email" = ? LIMIT ?  [["user_email", "sfsf"], ["LIMIT", 1]]